InformationRegisters/КомплектующиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КомплектующиеНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектующая</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаКомплектующей</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КомплектующиеНоменклатуры/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл

		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура должна быть заполнена обязательно!';uk=""Номенклатура повинна бути заповнена обов'язково!"""), Отказ);
		ИначеЕсли ЗаписьРегистра.Номенклатура.Услуга Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура не может быть услугой!';uk='Номенклатура не може бути послугою!'"), Отказ);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Комплектующая) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Комплектующая должна быть заполнена обязательно!';uk=""Комплектуюча повинна бути заповнена обов'язково!"""), Отказ);
		ИначеЕсли ЗаписьРегистра.Комплектующая.Услуга Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Комплектующая не может быть услугой!';uk='Комплектуюча не може бути послугою!'"), Отказ);
		ИначеЕсли ЗаписьРегистра.Комплектующая.Набор Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Комплектующая не может быть набором-пакетом!';uk='Комплектуюча не може бути набором-пакетом!'"), Отказ);
		ИначеЕсли ЗаписьРегистра.Комплектующая.Комплект Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Комплектующая не может быть набором-комплектом!';uk='Комплектуюча не може бути набором-комплектом!'"), Отказ);
		КонецЕсли;
		
		Если (ЗаписьРегистра.Комплектующая = ЗаписьРегистра.Номенклатура)
		   И ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура не может совпадать с комплектующей!';uk='Номенклатура не може збігатися з комплектуючої!'"), Отказ);
		КонецЕсли;

		Если ЗаписьРегистра.Количество = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Количество не должно быть нулевым!';uk='Кількість не повинна бути нульовою!'"), Отказ);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
